OpenNuvoton/NUC970_NuWriter/TurboWriterFW/TurboWriterFW/source/sm.c
        case 0xd3:  // 1024M
            if ((tempID[3] & 0x33) == 0x32)
            {
                pSM->uBlockPerFlash = 2047;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 1024;    /* 128x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T8;
                pSM->uSpareSize = 128;
            }
            else if ((tempID[3] & 0x33) == 0x11)
            {
                pSM->uBlockPerFlash = 8191;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 256;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->uSpareSize = 64;
            }
            else if ((tempID[3] & 0x33) == 0x21)
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 512;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->uSpareSize = 64;
            }
            else if ((tempID[3] & 0x33) == 0x22)
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 512; /* 64x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T8;
                pSM->uSpareSize = 128;
            }
            pSM->bIsMulticycle = TRUE;
            break;

        case 0xd5:  // 2048M
            // H27UAG8T2A
            if ((tempID[0]==0xAD)&&(tempID[2] == 0x94)&&(tempID[3] == 0x25))
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 1024;    /* 128x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T12;
                pSM->bIsMulticycle = TRUE;
                pSM->uSpareSize = 224;
                break;
            }
            // 2011/7/28, To support Hynix H27UAG8T2B NAND flash
            else if ((tempID[0]==0xAD)&&(tempID[2]==0x94)&&(tempID[3]==0x9A))
            {
                pSM->uBlockPerFlash = 1023;        // block index with 0-base. = physical blocks - 1
                pSM->uPagePerBlock = 256;
                pSM->uPageSize = 8192;
                pSM->uSectorPerBlock = pSM->uPageSize / 512 * pSM->uPagePerBlock;
                pSM->uNandECC = BCH_T24;
                pSM->bIsMulticycle = TRUE;
                pSM->uSpareSize = 448;
                break;
            }
            // 2011/7/28, To support Toshiba TC58NVG4D2FTA00 NAND flash
            else if ((tempID[0]==0x98)&&(tempID[2]==0x94)&&(tempID[3]==0x32))
            {
                pSM->uBlockPerFlash = 2075;        // block index with 0-base. = physical blocks - 1
                pSM->uPagePerBlock = 128;
                pSM->uPageSize = 8192;
                pSM->uSectorPerBlock = pSM->uPageSize / 512 * pSM->uPagePerBlock;
                pSM->uNandECC = BCH_T24;
                pSM->bIsMulticycle = TRUE;
                pSM->uSpareSize = 376;
                break;
            }
            else if ((tempID[3] & 0x33) == 0x32)
            {
                pSM->uBlockPerFlash = 4095;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 1024;    /* 128x8 */
                pSM->uPageSize = 4096;
                pSM->uNandECC = BCH_T8;
                pSM->bIsMLCNand = TRUE;
                pSM->uSpareSize = 128;
            }
            else if ((tempID[3] & 0x33) == 0x11)
            {
                pSM->uBlockPerFlash = 16383;
                pSM->uPagePerBlock = 64;
                pSM->uSectorPerBlock = 256;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->bIsMLCNand = FALSE;
                pSM->uSpareSize = 64;
            }
            else if ((tempID[3] & 0x33) == 0x21)
            {
                pSM->uBlockPerFlash = 8191;
                pSM->uPagePerBlock = 128;
                pSM->uSectorPerBlock = 512;
                pSM->uPageSize = 2048;
                pSM->uNandECC = BCH_T4;
                pSM->bIsMLCNand = TRUE;
                pSM->uSpareSize = 64;
            }
            pSM->bIsMulticycle = TRUE;
            break;

        default:
            MSG_DEBUG("SM ID not support!![%x][%x]\n", tempID[0], tempID[1]);
            return Fail;
    }

    MSG_DEBUG("SM ID [%x][%x][%x][%x]\n", tempID[0], tempID[1], tempID[2], tempID[3]);
    return Successful;
}

/*-----------------------------------------------------------------------------
 * 2011/7/28 by CJChen1@nuvoton.com, To issue command and address to NAND flash chip
 *  to order NAND flash chip to prepare the data or RA data at chip side and wait FMI to read actually.
 *  Support large page size 2K / 4K / 8K.
 *  INPUT: ucColAddr = 0 means prepare data from begin of page;
 *                   = <page size> means prepare RA data from begin of spare area.
 *---------------------------------------------------------------------------*/
INT fmiSM2BufferM_large_page(UINT32 uPage, UINT32 ucColAddr)
{
	// clear R/B flag
    while(!(inpw(REG_SMISR) & 0x40000));
    outpw(REG_SMISR, 0x400);

	outpw(REG_SMCMD, 0x00);		// read command
	outpw(REG_SMADDR, ucColAddr);	                // CA0 - CA7
	outpw(REG_SMADDR, (ucColAddr >> 8) & 0xFF);	    // CA8 - CA11
	outpw(REG_SMADDR, uPage & 0xff);	            // PA0 - PA7

	if (!pSM->bIsMulticycle)
		outpw(REG_SMADDR, ((uPage >> 8) & 0xff)|0x80000000);    // PA8 - PA15
	else
	{
		outpw(REG_SMADDR, (uPage >> 8) & 0xff);		        // PA8 - PA15
		outpw(REG_SMADDR, ((uPage >> 16) & 0xff)|0x80000000);   // PA16 - PA18
	}
	outpw(REG_SMCMD, 0x30);		// read command

	if (!fmiSMCheckRB())
		return FMI_SM_RB_ERR;
  else
		return 0;
}


INT fmiSM_Read_RA(UINT32 uPage, UINT32 ucColAddr)
{
    return fmiSM2BufferM_large_page(uPage, ucColAddr);
}

INT fmiCheckInvalidBlockExcept0xF0(FMI_SM_INFO_T *pSM, UINT32 BlockNo){
	int volatile status=0;
	unsigned int volatile sector;
	unsigned char volatile data512=0xff, data517=0xff, blockStatus=0xff;

	if (pSM->bIsMLCNand == TRUE)
		sector = (BlockNo+1) * pSM->uPagePerBlock - 1;
	else
		sector = BlockNo * pSM->uPagePerBlock;

	status = fmiSM_Read_RA(sector, pSM->uPageSize);
	if (status < 0)
	{
		sysprintf("ERROR: fmiCheckInvalidBlock(), for block %d, return 0x%x\n", BlockNo, status);
		return 1;
	}
	blockStatus = inpw(REG_SMDATA) & 0xff;
	if (blockStatus == 0xFF || blockStatus == 0xF0)
    {
        fmiSM_Reset();
        status = fmiSM_Read_RA(sector+1, pSM->uPageSize);
        if (status < 0)
        {
            sysprintf("ERROR: fmiCheckInvalidBlock(), for block %d, return 0x%x\n", BlockNo, status);
            return 1;
        }
        blockStatus = inpw(REG_SMDATA) & 0xff;
        if (blockStatus != 0xFF && blockStatus != 0xF0 )
        {
            sysprintf("ERROR: blockStatus != 0xFF(0x%2x)\n", blockStatus);
            fmiSM_Reset();					  
            return 1;	// invalid block
        }
    }
    else
    {
        fmiSM_Reset();			  
        return 1;	// invalid block
    }

