OpenNuvoton/NUC970_NuWriter/TurboWriterFW/TurboWriterFW/source/sm.c
	fmiSM_Reset();
	return 0;
}

INT fmiCheckInvalidBlock(FMI_SM_INFO_T *pSM, UINT32 BlockNo)
{
	int volatile status=0;
	unsigned int volatile sector;
	unsigned char volatile data512=0xff, data517=0xff, blockStatus=0xff;

	if (pSM->bIsMLCNand == TRUE)
		sector = (BlockNo+1) * pSM->uPagePerBlock - 1;
	else
		sector = BlockNo * pSM->uPagePerBlock;

	status = fmiSM_Read_RA(sector, pSM->uPageSize);
	if (status < 0)
	{
		sysprintf("ERROR: fmiCheckInvalidBlock(), for block %d, return 0x%x\n", BlockNo, status);
		return 1;
	}
	blockStatus = inpw(REG_SMDATA) & 0xff;
	if (blockStatus == 0xFF)
    {
        fmiSM_Reset();
        status = fmiSM_Read_RA(sector+1, pSM->uPageSize);
        if (status < 0)
        {
            sysprintf("ERROR: fmiCheckInvalidBlock(), for block %d, return 0x%x\n", BlockNo, status);
            return 1;
        }
        blockStatus = inpw(REG_SMDATA) & 0xff;
        if (blockStatus != 0xFF)
        {
            fmiSM_Reset();					  
            return 1;	// invalid block
        }
    }
    else
    {
        fmiSM_Reset();			  
        return 1;	// invalid block
    }

	fmiSM_Reset();
	return 0;
}


INT fmiSM_BlockErase(FMI_SM_INFO_T *pSM, UINT32 uBlock)
{
    UINT32 page_no;

    #ifndef ERASE_WITH_0XF0
    if (fmiCheckInvalidBlock(pSM, uBlock) != 1)
    #else
    if (fmiCheckInvalidBlockExcept0xF0(pSM, uBlock) != 1)
    #endif
    {
        page_no = uBlock * pSM->uPagePerBlock;      // get page address

    while(!(inpw(REG_SMISR) & 0x40000));
    outpw(REG_SMISR, 0x400);

    if (inpw(REG_SMISR) & 0x4)
    {
      sysprintf("erase: error sector !!\n");
      outpw(REG_SMISR, 0x4);
    }
        outpw(REG_SMCMD, 0x60);     // erase setup command

        outpw(REG_SMADDR, (page_no & 0xff));        // PA0 - PA7
        if (!pSM->bIsMulticycle)
            outpw(REG_SMADDR, ((page_no  >> 8) & 0xff)|0x80000000);     // PA8 - PA15
        else
        {
            outpw(REG_SMADDR, ((page_no  >> 8) & 0xff));        // PA8 - PA15
            outpw(REG_SMADDR, ((page_no  >> 16) & 0xff)|0x80000000);        // PA16 - PA17
        }

        outpw(REG_SMCMD, 0xd0);     // erase command
        if (!fmiSMCheckRB())
            return FMI_SM_RB_ERR;

        outpw(REG_SMCMD, 0x70);     // status read command
        if (inpw(REG_SMDATA) & 0x01)    // 1:fail; 0:pass
            return FMI_SM_STATUS_ERR;
	}
	else
		return Fail;

    return Successful;
}

INT fmiSM_BlockEraseBad(FMI_SM_INFO_T *pSM, UINT32 uBlock)
{
    UINT32 page_no;

        page_no = uBlock * pSM->uPagePerBlock;      // get page address

		while(!(inpw(REG_SMISR) & 0x40000));
		outpw(REG_SMISR, 0x400);

		if (inpw(REG_SMISR) & 0x4)
		{
			sysprintf("erase: error sector !!\n");
			outpw(REG_SMISR, 0x4);
		}
        outpw(REG_SMCMD, 0x60);     // erase setup command

        outpw(REG_SMADDR, (page_no & 0xff));        // PA0 - PA7
        if (!pSM->bIsMulticycle)
            outpw(REG_SMADDR, ((page_no  >> 8) & 0xff)|0x80000000);     // PA8 - PA15
        else
        {
            outpw(REG_SMADDR, ((page_no  >> 8) & 0xff));        // PA8 - PA15
            outpw(REG_SMADDR, ((page_no  >> 16) & 0xff)|0x80000000);        // PA16 - PA17
        }

        outpw(REG_SMCMD, 0xd0);     // erase command
        if (!fmiSMCheckRB())
            return FMI_SM_RB_ERR;

        outpw(REG_SMCMD, 0x70);     // status read command
        if (inpw(REG_SMDATA) & 0x01)    // 1:fail; 0:pass
            return FMI_SM_STATUS_ERR;

    return Successful;
}


INT fmiMarkBadBlock(FMI_SM_INFO_T *pSM, UINT32 BlockNo)
{
    UINT32 uSector, ucColAddr;

	/* check if MLC NAND */
	if (pSM->bIsMLCNand == TRUE)
	{
		uSector = (BlockNo+1) * pSM->uPagePerBlock - 1;	// write last page
		ucColAddr = pSM->uPageSize;

		// send command
		outpw(REG_SMCMD, 0x80);		// serial data input command
		outpw(REG_SMADDR, ucColAddr);	// CA0 - CA7
		outpw(REG_SMADDR, (ucColAddr >> 8) & 0xff);	// CA8 - CA11
		outpw(REG_SMADDR, uSector & 0xff);	// PA0 - PA7
		if (!pSM->bIsMulticycle)
			outpw(REG_SMADDR, ((uSector >> 8) & 0xff)|0x80000000);		// PA8 - PA15
		else
		{
			outpw(REG_SMADDR, (uSector >> 8) & 0xff);		// PA8 - PA15
			outpw(REG_SMADDR, ((uSector >> 16) & 0xff)|0x80000000);		// PA16 - PA17
		}
	    outpw(REG_SMDATA, 0xf0);	// mark bad block (use 0xf0 instead of 0x00 to differ from Old (Factory) Bad Blcok Mark)
	    outpw(REG_SMCMD, 0x10);

	    if (! fmiSMCheckRB())
			return FMI_SM_RB_ERR;

		fmiSM_Reset();
	    return 0;
	}
	/* SLC check the 2048 byte of 1st or 2nd page per block */
	else	// SLC
	{
		uSector = BlockNo * pSM->uPagePerBlock;		// write lst page
		if (pSM->uPageSize == 512)
		{
			ucColAddr = 0;			// write 4096th byte
			goto _mark_512;
		}
		else
            ucColAddr = pSM->uPageSize;

		// send command
		outpw(REG_SMCMD, 0x80);		// serial data input command
		outpw(REG_SMADDR, ucColAddr);	// CA0 - CA7
		outpw(REG_SMADDR, (ucColAddr >> 8) & 0xff);	// CA8 - CA11
		outpw(REG_SMADDR, uSector & 0xff);	// PA0 - PA7
		if (!pSM->bIsMulticycle)
			outpw(REG_SMADDR, ((uSector >> 8) & 0xff)|0x80000000);		// PA8 - PA15
		else
		{
			outpw(REG_SMADDR, (uSector >> 8) & 0xff);		// PA8 - PA15
			outpw(REG_SMADDR, ((uSector >> 16) & 0xff)|0x80000000);		// PA16 - PA17
		}
	    outpw(REG_SMDATA, 0xf0);	// mark bad block (use 0xf0 instead of 0x00 to differ from Old (Factory) Bad Blcok Mark)
	    outpw(REG_SMCMD, 0x10);

	    if (! fmiSMCheckRB())
			return FMI_SM_RB_ERR;

		fmiSM_Reset();
    	return 0;

_mark_512:

		outpw(REG_SMCMD, 0x50);		// point to redundant area
		outpw(REG_SMCMD, 0x80);		// serial data input command
		outpw(REG_SMADDR, ucColAddr);	// CA0 - CA7
		outpw(REG_SMADDR, uSector & 0xff);	// PA0 - PA7
		if (!pSM->bIsMulticycle)
			outpw(REG_SMADDR, ((uSector >> 8) & 0xff)|0x80000000);		// PA8 - PA15
		else
		{
			outpw(REG_SMADDR, (uSector >> 8) & 0xff);		// PA8 - PA15
			outpw(REG_SMADDR, ((uSector >> 16) & 0xff)|0x80000000);		// PA16 - PA17
		}

	    outpw(REG_SMDATA, 0xf0);	// 512
	    outpw(REG_SMDATA, 0xff);
	    outpw(REG_SMDATA, 0xff);
	    outpw(REG_SMDATA, 0xff);
	    outpw(REG_SMDATA, 0xf0);	// 516
	    outpw(REG_SMDATA, 0xf0);	// 517
	    outpw(REG_SMCMD, 0x10);
	    if (! fmiSMCheckRB())
			return FMI_SM_RB_ERR;

