OpenNuvoton/NUC970_NuWriter/TurboWriterFW/TurboWriterFW/source/sm.c
		fmiSM_Reset();
    	return 0;
	}
}

INT fmiSM_Erase(UINT32 uChipSel,UINT32 start, UINT32 len)
{
    int i, status;
    int volatile badBlock=0;

    // erase all chip
    for (i=0; i<len; i++)
    {
        #ifndef ERASE_WITH_0XF0
        if (fmiCheckInvalidBlock(pSM, i+start) != 1)
        #else
        if (fmiCheckInvalidBlockExcept0xF0(pSM, i+start) != 1)
        #endif
        {
            status = fmiSM_BlockErase(pSM, i+start);
            if (status < 0)
            {
                fmiMarkBadBlock(pSM, i+start);
                badBlock++;
            }
        }
        else
            badBlock++;

        /* send status */
        SendAck(((i+1)*100) /(len));
    }
    return badBlock;
}

INT fmiSM_EraseBad(UINT32 uChipSel,UINT32 start, UINT32 len)
{
    int i, status;
    int volatile badBlock=0;

    // erase all chip
    for (i=0; i<len; i++)
    {
            status = fmiSM_BlockEraseBad(pSM, i+start);
            if (status < 0)
            {
                fmiMarkBadBlock(pSM, i+start);
                badBlock++;
            }
        /* send status */
        SendAck(((i+1)*100) /(len));
    }
    return badBlock;
}

//-----------------------------------------------------
INT fmiSM_ChipErase(UINT32 uChipSel)
{
    int i, status;
    int volatile badBlock=0;

    // erase all chip
    for (i=0; i<=pSM->uBlockPerFlash; i++)
    {
        #ifndef ERASE_WITH_0XF0
        if (fmiCheckInvalidBlock(pSM, i) != 1)
        #else
        if (fmiCheckInvalidBlockExcept0xF0(pSM, i) != 1)
        #endif
        {
            status = fmiSM_BlockErase(pSM, i);
            if (status < 0)
            {
                fmiMarkBadBlock(pSM, i);
                badBlock++;
            }
        }
        else
            badBlock++;

        /* send status */
        SendAck((i*100) / pSM->uBlockPerFlash);
    }
    return badBlock;
}

INT fmiSM_ChipEraseBad(UINT32 uChipSel)
{
    int i, status;
    int volatile badBlock=0;

    // erase all chip
    for (i=0; i<=pSM->uBlockPerFlash; i++)
    {
            status = fmiSM_BlockEraseBad(pSM, i);
            if (status < 0)
            {
                fmiMarkBadBlock(pSM, i);
                badBlock++;
            }
        /* send status */
        SendAck((i*100) / pSM->uBlockPerFlash);
    }
    return badBlock;
}

/*-----------------------------------------------------------------------------
 * Really write data and parity code to 2K/4K/8K page size NAND flash by NAND commands.
 *---------------------------------------------------------------------------*/
INT fmiSM_Write_large_page_oob(UINT32 uSector, UINT32 ucColAddr, UINT32 uSAddr,UINT32 oobsize)
{
	int k;
	outpw(REG_NAND_DMACSAR, uSAddr);// set DMA transfer starting address

	// write the spare area configuration  
	for(k=0;k<pSM->uSpareSize;k+=4)
		outpw(REG_SMRA0+k, *(unsigned int *)(uSAddr+pSM->uPageSize+k));

	// clear R/B flag
    while(!(inpw(REG_SMISR) & 0x40000));
    outpw(REG_SMISR, 0x400);

	// send command
	outpw(REG_SMCMD, 0x80);		                // serial data input command
	outpw(REG_SMADDR, ucColAddr);	            // CA0 - CA7
	outpw(REG_SMADDR, (ucColAddr >> 8) & 0x3f);	// CA8 - CA12
	outpw(REG_SMADDR, uSector & 0xff);	        // PA0 - PA7

	if (!pSM->bIsMulticycle)
		outpw(REG_SMADDR, ((uSector >> 8) & 0xff)|0x80000000);  // PA8 - PA15
	else
	{
		outpw(REG_SMADDR, (uSector >> 8) & 0xff);		    // PA8 - PA15
		outpw(REG_SMADDR, ((uSector >> 16) & 0xff)|0x80000000); // PA16 - PA17
	}

    outpw(REG_SMISR, 0x1);	        // clear DMA flag
    outpw(REG_SMISR, 0x4);	        // clear ECC_FIELD flag
    outpw(REG_SMISR, 0x8);	        // clear Region Protect flag
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x10);    // auto write redundancy data to NAND after page data written
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x4);     // begin to write one page data to NAND flash

	while(1)
	{
		if (inpw(REG_SMISR) & 0x1)         // wait to finish DMAC transfer.
            break;
	}

    outpw(REG_SMISR, 0x1);  // clear DMA flag
	outpw(REG_SMCMD, 0x10);	// auto program command

	if (!fmiSMCheckRB())
		return FMI_SM_RB_ERR;

    //--- check Region Protect result
    if (inpw(REG_SMISR) & 0x8)
    {
		sysprintf("ERROR: fmiSM_Write_large_page(): region write protect detected!!\n");
        outpw(REG_SMISR, 0x8);      // clear Region Protect flag
	    return Fail;
	}

	outpw(REG_SMCMD, 0x70);		    // status read command
	if (inpw(REG_SMDATA) & 0x01)	// 1:fail; 0:pass
	{
		sysprintf("ERROR: fmiSM_Write_large_page(): data error!!\n");
		return FMI_SM_STATE_ERROR;
	}
	return 0;
}

INT fmiSM_Write_large_page_oob2(UINT32 uSector, UINT32 ucColAddr, UINT32 uSAddr){
  UINT32 readlen,i;
  
  readlen=pSM->uPageSize+pSM->uSpareSize;
  outpw(REG_SMCMD,  0x80);  // serial data input command
  outpw(REG_SMADDR, 0x00);  // CA0 - CA7
  outpw(REG_SMADDR, 0x00);  // CA8 - CA12
  
  outpw(REG_SMADDR, uSector & 0xff);                      // PA0 - PA7
  outpw(REG_SMADDR, ((uSector >> 8) & 0xff));  // PA8 - PA15
  outpw(REG_SMADDR, ((uSector >> 16) & 0xff));            // PA16 - PA17
  outpw(REG_SMADDR, ((uSector >> 24) & 0xff)|0x80000000);
  MSG_DEBUG("readlen=%d\n",readlen);
  for (i=0; i<readlen; i++)
      outpw(REG_SMDATA, ((unsigned char *)uSAddr)[i]);

  outpw(REG_SMCMD, 0x10);               // auto program command
  
  if (!fmiSMCheckRB())
    return FMI_SM_RB_ERR;
  
  return 0;
}

INT fmiSM_Write_large_page(UINT32 uSector, UINT32 ucColAddr, UINT32 uSAddr)
{
	outpw(REG_NAND_DMACSAR, uSAddr);	// set DMA transfer starting address

	// set the spare area configuration
	/* write byte 2050, 2051 as used page */
	outpw(REG_SMRA0, 0x0000FFFF);

	// clear R/B flag
    while(!(inpw(REG_SMISR) & 0x40000));
    outpw(REG_SMISR, 0x400);

	// send command
	outpw(REG_SMCMD, 0x80);		                // serial data input command
	outpw(REG_SMADDR, ucColAddr);	            // CA0 - CA7
	outpw(REG_SMADDR, (ucColAddr >> 8) & 0x3f);	// CA8 - CA12
	outpw(REG_SMADDR, uSector & 0xff);	        // PA0 - PA7

	if (!pSM->bIsMulticycle)
		outpw(REG_SMADDR, ((uSector >> 8) & 0xff)|0x80000000);  // PA8 - PA15
	else
	{
		outpw(REG_SMADDR, (uSector >> 8) & 0xff);		    // PA8 - PA15
		outpw(REG_SMADDR, ((uSector >> 16) & 0xff)|0x80000000); // PA16 - PA17
	}

    outpw(REG_SMISR, 0x1);	        // clear DMA flag
    outpw(REG_SMISR, 0x4);	        // clear ECC_FIELD flag
    outpw(REG_SMISR, 0x8);	        // clear Region Protect flag
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x10);    // auto write redundancy data to NAND after page data written
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x4);     // begin to write one page data to NAND flash

	while(1)
	{
		if (inpw(REG_SMISR) & 0x1)         // wait to finish DMAC transfer.
            break;
	}

    outpw(REG_SMISR, 0x1);  // clear DMA flag
	outpw(REG_SMCMD, 0x10);	// auto program command

	if (!fmiSMCheckRB())
		return FMI_SM_RB_ERR;

    //--- check Region Protect result
    if (inpw(REG_SMISR) & 0x8)
    {
    sysprintf("ERROR: fmiSM_Write_large_page(): region write protect detected!!\n");
        outpw(REG_SMISR, 0x8);      // clear Region Protect flag
      return Fail;
  }

