OpenNuvoton/NUC970_NuWriter/TurboWriterFW/TurboWriterFW/source/sm.c
  outpw(REG_SMCMD, 0x70);		    // status read command
  if (inpw(REG_SMDATA) & 0x01)	// 1:fail; 0:pass
  {
    sysprintf("ERROR: fmiSM_Write_large_page(): data error!!\n");
    return FMI_SM_STATE_ERROR;
  }
  return 0;
}


static void fmiSM_CorrectData_BCH(UINT8 ucFieidIndex, UINT8 ucErrorCnt, UINT8* pDAddr)
{
    UINT32 uaData[24], uaAddr[24];
	UINT32 uaErrorData[4];
	UINT8  ii, jj;
	UINT32 uPageSize;
	UINT32 field_len, padding_len, parity_len;
	UINT32 total_field_num;
    UINT8  *smra_index;

    //--- assign some parameters for different BCH and page size
    switch (inpw(REG_SMCSR) & 0x7c0000)
    {
        case BCH_T24:
            field_len   = 1024;
            padding_len = BCH_PADDING_LEN_1024;
            parity_len  = BCH_PARITY_LEN_T24;
            break;
        case BCH_T15:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T15;
            break;
        case BCH_T12:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T12;
            break;
        case BCH_T8:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T8;
            break;
        case BCH_T4:
            field_len   = 512;
            padding_len = BCH_PADDING_LEN_512;
            parity_len  = BCH_PARITY_LEN_T4;
            break;
        default:
            sysprintf("ERROR: fmiSM_CorrectData_BCH(): invalid SMCR_BCH_TSEL = 0x%08X\n", (UINT32)(inpw(REG_SMCSR) & 0x7c0000));
            return;
    }

	uPageSize = inpw(REG_SMCSR) & 0x30000;
    switch (uPageSize)
    {
        case 0x30000: total_field_num = 8192 / field_len; break;
        case 0x20000: total_field_num = 4096 / field_len; break;
        case 0x10000: total_field_num = 2048 / field_len; break;
        case 0x00000: total_field_num =  512 / field_len; break;
        default:
            sysprintf("ERROR: fmiSM_CorrectData_BCH(): invalid SMCR_PSIZE = 0x%08X\n", uPageSize);
            return;
    }

    //--- got valid BCH_ECC_DATAx and parse them to uaData[]
    // got the valid register number of BCH_ECC_DATAx since one register include 4 error bytes
    jj = ucErrorCnt/4;
	jj ++;
	if (jj > 6)
	    jj = 6;     // there are 6 BCH_ECC_DATAx registers to support BCH T24

    for(ii=0; ii<jj; ii++)
    {
		uaErrorData[ii] = inpw(REG_BCH_ECC_DATA0 + ii*4);
	}

    for(ii=0; ii<jj; ii++)
    {
	    uaData[ii*4+0] = uaErrorData[ii] & 0xff;
	    uaData[ii*4+1] = (uaErrorData[ii]>>8) & 0xff;
	    uaData[ii*4+2] = (uaErrorData[ii]>>16) & 0xff;
	    uaData[ii*4+3] = (uaErrorData[ii]>>24) & 0xff;
	}

    //--- got valid REG_BCH_ECC_ADDRx and parse them to uaAddr[]
    // got the valid register number of REG_BCH_ECC_ADDRx since one register include 2 error addresses
    jj = ucErrorCnt/2;
    jj ++;
	if (jj > 12)
	    jj = 12;    // there are 12 REG_BCH_ECC_ADDRx registers to support BCH T24

    for(ii=0; ii<jj; ii++)
    {
	    uaAddr[ii*2+0] = inpw(REG_BCH_ECC_ADDR0 + ii*4) & 0x07ff;   // 11 bits for error address
	    uaAddr[ii*2+1] = (inpw(REG_BCH_ECC_ADDR0 + ii*4)>>16) & 0x07ff;
    }

    //--- pointer to begin address of field that with data error
    pDAddr += (ucFieidIndex-1) * field_len;

    //--- correct each error bytes
    for(ii=0; ii<ucErrorCnt; ii++)
    {
        // for wrong data in field
    	if (uaAddr[ii] < field_len)
    	{
  	        sysprintf("BCH error corrected for data: address 0x%08X, data [0x%02X] --> ",
  	            pDAddr+uaAddr[ii], *(pDAddr+uaAddr[ii]));

  	        *(pDAddr+uaAddr[ii]) ^= uaData[ii];

  	        sysprintf("[0x%02X]\n", *(pDAddr+uaAddr[ii]));
  	    }
  	    // for wrong first-3-bytes in redundancy area
		else if (uaAddr[ii] < (field_len+3))
		{
			uaAddr[ii] -= field_len;
			uaAddr[ii] += (parity_len*(ucFieidIndex-1));    // field offset

  	        sysprintf("BCH error corrected for 3 bytes: address 0x%08X, data [0x%02X] --> ",
  	            (UINT8 *)REG_SMRA0+uaAddr[ii], *((UINT8 *)REG_SMRA0+uaAddr[ii]));

  	        *((UINT8 *)REG_SMRA0+uaAddr[ii]) ^= uaData[ii];

  	        sysprintf("[0x%02X]\n", *((UINT8 *)REG_SMRA0+uaAddr[ii]));
    	}
    	// for wrong parity code in redundancy area
    	else
    	{
    	    // BCH_ERR_ADDRx = [data in field] + [3 bytes] + [xx] + [parity code]
    	    //                                   |<--     padding bytes      -->|
    	    // The BCH_ERR_ADDRx for last parity code always = field size + padding size.
    	    // So, the first parity code = field size + padding size - parity code length.
    	    // For example, for BCH T12, the first parity code = 512 + 32 - 23 = 521.
    	    // That is, error byte address offset within field is
    	    uaAddr[ii] = uaAddr[ii] - (field_len + padding_len - parity_len);

            // smra_index point to the first parity code of first field in register SMRA0~n
            smra_index = (UINT8 *)
                         (REG_SMRA0 + (inpw(REG_SMREACTL) & 0x1ff) - // bottom of all parity code -
                          (parity_len * total_field_num)             // byte count of all parity code
                         );

            // final address = first parity code of first field +
            //                 offset of fields +
            //                 offset within field
  	        sysprintf("BCH error corrected for parity: address 0x%08X, data [0x%02X] --> ",
  	            smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii],
  	            *((UINT8 *)smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii]));
  	        *((UINT8 *)smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii]) ^= uaData[ii];
  	        sysprintf("[0x%02X]\n", *((UINT8 *)smra_index + (parity_len * (ucFieidIndex-1)) + uaAddr[ii]));
        }
  	}   // end of for (ii<ucErrorCnt)
}


INT fmiSM_Read_move_data_ecc_check(UINT32 uDAddr)
{
	UINT32 uStatus;
	UINT32 uErrorCnt, ii, jj;
	volatile UINT32 uError = 0;
	UINT32 uLoop;

    //--- uLoop is the number of SM_ECC_STx should be check.
    //      One SM_ECC_STx include ECC status for 4 fields.
    //      Field size is 1024 bytes for BCH_T24 and 512 bytes for other BCH.
    switch (inpw(REG_SMCSR) & 0x30000)
    {
        case 0x10000:
            uLoop = 1;
            break;
        case 0x20000:
            if (inpw(REG_SMCSR) & 0x7c0000 == BCH_T24)
                uLoop = 1;
            else
                uLoop = 2;
            break;
        case 0x30000:
            if (inpw(REG_SMCSR) & 0x7c0000 == BCH_T24)
                uLoop = 2;
            else
                uLoop = 4;
            break;
        default:
            return -1;     // don't work for 512 bytes page
    }

	outpw(REG_NAND_DMACSAR, uDAddr);	// set DMA transfer starting address
    outpw(REG_SMISR, 0x1);	            // clear DMA flag
    outpw(REG_SMISR, 0x4);	            // clear ECC_FIELD flag
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x2);    // begin to move data by DMA

    //--- waiting for DMA transfer stop since complete or ECC error
    // IF no ECC error, DMA transfer complete and make SMCR[DRD_EN]=0
    // IF ECC error, DMA transfer suspend     and make SMISR[ECC_FIELD_IF]=1 but keep keep SMCR[DRD_EN]=1
    //      If we clear SMISR[ECC_FIELD_IF] to 0, DMA transfer will resume.
    // So, we should keep wait if DMA not complete (SMCR[DRD_EN]=1) and no ERR error (SMISR[ECC_FIELD_IF]=0)
	while((inpw(REG_SMCSR) & 0x2) && ((inpw(REG_SMISR) & 0x4)==0))
	    ;

