OpenNuvoton/NUC970_NuWriter/TurboWriterFW/TurboWriterFW/source/sm.c
    //--- DMA transfer completed or suspend by ECC error, check and correct ECC error
    while(1)
    {
        if (inpw(REG_SMISR) & 0x4)
        {
            for (jj=0; jj<uLoop; jj++)
            {
                uStatus = inpw(REG_SMECC_ST0+jj*4);
                if (!uStatus)
                    continue;   // no error on this register for 4 fields
                // ECC error !! Check 4 fields. Each field has 512 bytes data
                for (ii=1; ii<5; ii++)
                {
                    if (!(uStatus & 0x3))     // no error for this field
                    {
                        uStatus >>= 8;  // next field
                        continue;
                    }

                    if ((uStatus & 0x3)==0x01)  // correctable error in field (jj*4+ii)
                    {
                        // 2011/8/17 by CJChen1@nuvoton.com, mask uErrorCnt since Fx_ECNT just has 5 valid bits
                        uErrorCnt = (uStatus >> 2) & 0x1F;
                        fmiSM_CorrectData_BCH(jj*4+ii, uErrorCnt, (UINT8*)uDAddr);
                        sysprintf("Warning: Field %d have %d BCH error. Corrected!!\n", jj*4+ii, uErrorCnt);
                        break;
                    }
                    else if (((uStatus & 0x3)==0x02) ||
                             ((uStatus & 0x3)==0x03)) // uncorrectable error or ECC error in 1st field
                    {
                        sysprintf("ERROR: Field %d encountered uncorrectable BCH error!!\n", jj*4+ii);
                        uError = 1;
                        break;
                    }
                    uStatus >>= 8;  // next field
                }
            }
            outpw(REG_SMISR, 0x4);	   	// clear ECC_FIELD_IF to resume DMA transfer
        }

        if (inpw(REG_SMISR) & 0x1)      // wait to finish DMAC transfer.
        {
            if ( !(inpw(REG_SMISR) & 0x4) )
                break;
        }
    }   // end of while(1)

    if (uError)
   		return -1;
    else
	    return 0;
}


INT fmiSM_Read_large_page(FMI_SM_INFO_T *pSM, UINT32 uPage, UINT32 uDAddr)
{
    INT result;

    result = fmiSM2BufferM_large_page(uPage, 0);
    if (result != 0)
        return result;  // fail for FMI_SM_RB_ERR
    result = fmiSM_Read_move_data_ecc_check(uDAddr);
    if(result<0)
    {
      sysprintf("  ==> page_no=%d,address=0x%08x\n",uPage,uDAddr);
    }
    return result;
}


BOOL volatile _usbd_bIsFMIInit = FALSE;
INT fmiHWInit(void)
{
    if (_usbd_bIsFMIInit == FALSE)
    {
		// Enable SD Card Host Controller operation and driving clock.
		outpw(REG_HCLKEN, (inpw(REG_HCLKEN) | 0x700000)); /* enable FMI, NAND, SD clock */

		// DMAC Initial
		outpw(REG_NAND_DMACCSR, DMAC_CSR_SWRST | DMAC_CSR_EN);
        while(inpw(REG_NAND_DMACCSR) & DMAC_CSR_SWRST);

		outpw(REG_NAND_FMICSR, FMI_CSR_SWRST);		// reset FMI engine
		while(inpw(REG_NAND_FMICSR) & FMI_CSR_SWRST);

        _usbd_bIsFMIInit = TRUE;
    }
    return 0;
} /* end fmiHWInit */

INT fmiNandInit(void)
{
    /* select NAND function pins */
    if (inpw(REG_PWRON) & 0x08000000)
    {
        /* Set GPI for NAND */
        outpw(REG_MFP_GPI_L, 0x55555550);
        outpw(REG_MFP_GPI_H, 0x55555555);
    }
    else
    {
        /* Set GPC for NAND */
        outpw(REG_MFP_GPC_L, 0x55555555);
        outpw(REG_MFP_GPC_H, 0x05555555);
    }
    // enable SM
    outpw(REG_NAND_FMICSR, FMI_CSR_SM_EN);

    /* set page size = 512B (default) enable CS0, disable CS1 */
    outpw(REG_SMCSR, inpw(REG_SMCSR) & ~0x02030000 | 0x04000000);

    outpw(REG_SMTCR, 0x20305);
    outpw(REG_SMCSR, (inpw(REG_SMCSR) & ~0x30000) | 0x00000);	//512 byte
    outpw(REG_SMCSR, inpw(REG_SMCSR) |  0x100);	//protect RA 3 byte
	outpw(REG_SMCSR, inpw(REG_SMCSR) | 0x10);

    memset((char *)&SMInfo, 0, sizeof(FMI_SM_INFO_T));
    pSM = &SMInfo;
    if (fmiSM_ReadID(pSM) < 0)
        return Fail;
    fmiSM_Initial(pSM);

    return 0;
} /* end fmiHWInit */
